In [1]:
import pandas as pd
import numpy as np

In [5]:
series = pd.read_csv('datasets/daily-min-temperatures.csv', parse_dates=[0], index_col=0, squeeze=True)
series.head()

Date
1981-01-01    20.7
1981-01-02    17.9
1981-01-03    18.8
1981-01-04    14.6
1981-01-05    15.8
Name: Temp, dtype: float64

In [17]:
df = pd.DataFrame()
df['month'] = series.index.month
df['day'] = series.index.day
df['temperature'] = series.values
df.head()

   month  day  temperature
0      1    1         20.7
1      1    2         17.9
2      1    3         18.8
3      1    4         14.6
4      1    5         15.8

### Lag Features

In [19]:
series.shift(1).head()

Date
1981-01-01     NaN
1981-01-02    20.7
1981-01-03    17.9
1981-01-04    18.8
1981-01-05    14.6
Name: Temp, dtype: float64

In [27]:
df = pd.DataFrame(
    {'t': series.shift(1),
     't+1': series}
).reset_index(drop=True)
df.head()

      t   t+1
0   NaN  20.7
1  20.7  17.9
2  17.9  18.8
3  18.8  14.6
4  14.6  15.8

In [28]:
df = pd.DataFrame(
    {'t-2': series.shift(3),
     't-1': series.shift(2),
     't': series.shift(1),
     't+1': series}
).reset_index(drop=True)
df.head()

    t-2   t-1     t   t+1
0   NaN   NaN   NaN  20.7
1   NaN   NaN  20.7  17.9
2   NaN  20.7  17.9  18.8
3  20.7  17.9  18.8  14.6
4  17.9  18.8  14.6  15.8

### Rolling Window Statistics

In [31]:
series.head()

Date
1981-01-01    20.7
1981-01-02    17.9
1981-01-03    18.8
1981-01-04    14.6
1981-01-05    15.8
Name: Temp, dtype: float64

In [32]:
series.rolling(2).mean().head()

Date
1981-01-01      NaN
1981-01-02    19.30
1981-01-03    18.35
1981-01-04    16.70
1981-01-05    15.20
Name: Temp, dtype: float64

In [33]:
df = pd.DataFrame(
    {'mean(t-1, t)': series.shift(1).rolling(2).mean(),
     't+1': series}
).reset_index(drop=True)
df.head()

   mean(t-1, t)   t+1
0           NaN  20.7
1           NaN  17.9
2         19.30  18.8
3         18.35  14.6
4         16.70  15.8

In [44]:
window = series.expanding()
df = pd.DataFrame(
    {'t-1': series,
     't': series.shift(1),
     'sum': window.sum(),
     'mean': window.mean(),
     'min': window.min(),
     'max': window.max(),}
).reset_index(drop=True)
df.head()

    t-1     t   sum       mean   min   max
0  20.7   NaN  20.7  20.700000  20.7  20.7
1  17.9  20.7  38.6  19.300000  17.9  20.7
2  18.8  17.9  57.4  19.133333  17.9  20.7
3  14.6  18.8  72.0  18.000000  14.6  20.7
4  15.8  14.6  87.8  17.560000  14.6  20.7